Repository: gwanat/python_melanoma_app
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: pl

source: Based on the Total Dermatoscopy Score (TDS), the lesion is a benign blue nevus.
pl: Na podstawie Całkowitego Wskaźnika Dermatoskopowego (TDS), zmiana jest znamieniem błękitnym.

source: Based on the Total Dermatoscopy Score (TDS), the lesion is benign.
pl: Na podstawie Całkowitego Wskaźnika Dermatoskopowego (TDS), zmiana jest łagodna.

source: Based on the Total Dermatoscopy Score (TDS), the lesion is suspicious.
pl: Na podstawie Całkowitego Wskaźnika Dermatoskopowego (TDS), zmiana jest podejrzana.

source: Based on the Total Dermatoscopy Score (TDS), the lesion is malignant.
pl: Na podstawie Całkowitego Wskaźnika Dermatoskopowego (TDS), zmiana jest złośliwa.

source: Based on the improved version of Total Dermatoscopy Score (TDS), the lesion is a benign blue nevus.
pl: Na podstawie Nowego Całkowitego Wskaźnika Dermatoskopowego (TDS), zmiana jest znamieniem błękitnym.

source: Based on the improved version of Total Dermatoscopy Score (TDS), the lesion is benign.
pl: Na podstawie Nowego Całkowitego Wskaźnika Dermatoskopowego (TDS), zmiana jest łagodna.

source: Based on the improved version of Total Dermatoscopy Score (TDS), the lesion is suspicious.
pl: Na podstawie Nowego Całkowitego Wskaźnika Dermatoskopowego (TDS), zmiana jest podejrzana.

source: Based on the improved version of Total Dermatoscopy Score (TDS), the lesion is malignant.
pl: Na podstawie Nowego Całkowitego Wskaźnika Dermatoskopowego (TDS), zmiana jest złośliwa.

source: Lentigo Maligna Melanoma
pl: Czerniak wychodzący z plamy soczewicowatej

source: Appears in older adults, spreads to lymph nodes.
pl: Pojawia się u osób starszych, daje przerzuty do węzłów.

source: Occurs mainly in older people, especially women. It begins as a flat brown or brown-black spot. It has a slow, many-year course and a relatively good prognosis. This type of melanoma most often appears on the face. It causes metastases to nearby lymph nodes.
pl: Występuje głównie u starszych osób, szczególnie kobiet. Powstaje jako płaska brązowa lub brązowo-czarna plama. Ma powolny, wieloletni przebieg i dość dobrze rokuje. Ten rodzaj czerniaka najczęściej występuje na twarzy. Powoduje przerzuty do okolicznych węzłów chłonnych.

source: Superficial Spreading Melanoma
pl: Czerniak szerzący się powierzchownie

source: Most common type, spreads along the surface before going deeper.
pl: Najczęstszy typ, rozprzestrzenia się powierzchniowo przed penetracją głębszych warstw.

source: Usually develops on the basis of a mole. Most often affects middle-aged individuals, although it can also occur in children. It usually begins with a slow superficial growth phase, then the tumor grows vertically, infiltrating the skin and subcutaneous tissue. At that point, it begins to metastasize. It often appears on the trunk (more often in men) or on the legs and mucous membranes (more often in women).
pl: Powstaje zazwyczaj na podłożu znamienia. Najczęściej dotyczy osób w średnim wieku, choć może występować również u dzieci. Zazwyczaj zaczyna się od powolnej fazy wzrostu powierzchownego, potem nowotwór rośnie pionowo naciekając skórę i tkankę podskórną. Wtedy zaczyna dawać przerzuty. Występuje często na tułowiu (częściej u mężczyzn) lub na nogach i błonach śluzowych (częściej u kobiet).

source: Nodular Melanoma
pl: Postać guzkowa czerniaka

source: Aggressive, fast-growing nodule, metastasizes quickly.
pl: Agresywny, szybko rosnący guzek, daje przerzuty szybko.

source: Arises on the basis of a pigmented mole or on healthy skin. This type of melanoma progresses quickly and has a poor prognosis. Men are more frequently affected than women. The lesion most commonly appears on the head, neck, or trunk. It can be a colorless, brown, red, or black nodule, which grows vertically from the start and rapidly causes metastases.
pl: Powstaje na podłożu znamienia barwnikowego lub na skórze zdrowej. Ta postać czerniaka ma szybki przebieg i niekorzystne rokowanie. Częściej chorują mężczyźni niż kobiety. Zmiana najczęściej powstaje na głowie, szyi, tułowiu. Może to być bezbarwny, brunatny, czerwony lub czarny guzek, który od początku rośnie pionowo i szybko powoduje przerzuty.

source: Acrolenitiginous Melanoma
pl: Czerniak kończynowo-lentiginalny

source: Rare type, appears on palms, soles, or under nails.
pl: Rzadki typ, pojawia się na dłoniach, podeszwach lub pod paznokciami.

source: A melanoma with relatively slow growth, occurring mainly in middle-aged individuals. It affects the hands, soles of the feet, or the nail matrix. These are enlarging flat brown or black patches that cause metastases to lymph nodes.
pl: Czerniak o dość powolnym wzroście, występuje głównie u osób w wieku średnim. Zajmuje dłonie, podeszwy, macierz paznokcia. Są to powiększające się płaskie, brązowe lub czarne plamy, powodujące przerzuty do węzłów chłonnych.

source: Amelanotic Melanoma
pl: Czerniak amelanotyczny

source: Rare, skin-colored or pink lesion, often diagnosed late.
pl: Rzadka, cielista lub różowa zmiana, często późno rozpoznawana.

source: This type of melanoma is very rare. The lesion arises on previously unchanged skin and has the color of normal skin or is pinkish. Because of this, it is often diagnosed very late, which further worsens the already poor prognosis.
pl: Ta postać czerniaka jest bardzo rzadka. Zmiana powstaje na skórze niezmienionej i ma kolor skóry prawidłowej lub różowawy. Z tego powodu bywa bardzo późno rozpoznawany, co dodatkowo pogarsza i tak niekorzystne rokowanie.

source: Oral mucosal melanoma
pl: Czerniak błon śluzowych

source: Dark, painless spot or nodule in the mouth, metastasizes early.
pl: Ciemna, bezbolesna plamka lub guzek w ustach, szybko daje przerzuty.

source: In about 5 percent of cases, melanoma is located on the mucous membranes of the oral cavity. It is most often a dark spot or a soft, dark, well-vascularized nodule. Such a nodule is usually painless. The prognosis is poor, as the tumor grows vertically from the beginning and quickly metastasizes. Therefore, any dark lesion on the oral mucous membranes without a clear cause should raise suspicion of melanoma.
pl: W około 5 procentach przypadków czerniak zlokalizowany jest na błonach śluzowych jamy ustnej. Jest to najczęściej ciemna plamka lub miękki, ciemny, dobrze unaczyniony guzek. Zazwyczaj taki guzek jest niebolesny. Rokowanie jest niekorzystne, gdyż złe nowotwór od początku rośnie pionowo i szybko daje przerzuty. Dlatego uważa się, że w przypadku każdej ciemnej zmiany na błonach śluzowych jamy ustnej, która nie ma jednoznacznej przyczyny należy brać pod uwagę rozpoznanie czerniaka.

source: Vulvovaginal melanoma
pl: Czerniak pochwy i sromu

source: Rare, aggressive lesion on labia or lower vagina.
pl: Rzadka, agresywna zmiana na sromie lub w dolnej części pochwy.

source: Melanomas in this location are rare. They mainly affect the labia minora and the lower third of the vagina. Most commonly, women over 50 are affected. Melanoma in this location usually develops from a pigmented mole. It is a spot or nodule with a tendency to bleed and associated itching. It grows and metastasizes quickly.
pl: Czerniaki w tej lokalizacji są rzadkie. Dotyczą głównie warg sromowych mniejszych i dolnej 1/3 pochwy. Chorują najczęściej kobiety po 50 roku życia. Czerniak w tej lokalizacji najczęściej powstaje na podłożu znamienia barwnikowego. Jest to plama lub guzek z tendencją do krwawienia i towarzyszącym świądem. Rośnie i daje przerzuty szybko.

source: ABCD Rule for Melanoma Detection
pl: Formuła ABCD dla Wykrywania Czerniaka

source: ABCD Rule
pl: O formule ABCD

source: Learn how dermatologists assess skin lesions using ABCD Rule.
pl: Dowiedz się jak dermatolodzy rozróżniają zmiany skórne używając formuły ABCD.

source: Strategies for Evaluating Melanocytic Lesions
pl: Strategie oceny znamion melanocytowych

source: The most frequently cited strategies for evaluating melanocytic skin lesions in the literature include: the Argenziano strategy (the so-called 7-point checklist), the Menzies strategy, and the Stolz strategy based on the ABCD rule, which serves as the basis for our preliminary diagnostic form for melanocytic lesions.
pl: Do strategii oceny znamion melanocytowych skóry najczęściej cytowanych w literaturze należą: strategiaArgenziano (tzw. skala 7-punktowa), strategia Menzies'a oraz strategia Stolz'a, oparta na zastosowaniu tzw.reguły ABCD, która to jest bazą naszego formularza do wstępnej diagnostyki znamion melanocytowych.

source: Stolz Strategy
pl: Strategia Stolz'a

source: This strategy, a modification of the Braun-Falco approach, uses the ABCD rule to assess melanocytic lesions. Each letter corresponds to one of the key features of the lesion:
pl: Strategia ta, będąca modyfikacją podejścia Braun-Falco, wykorzystuje regułę ABCD do oceny znamionmelanocytowych. Każda litera odpowiada jednej z kluczowych cech znamienia:

source: Asymmetry
pl: Asymetria

source: assessment of the degree of asymmetry in shape and structure of the lesion
pl: ocena stopnia asymetrii kształtu i struktury znamienia

source: Border
pl: Brzeg

source: characteristics of the border - whether it is regular or irregular
pl: charakterystyka brzegu - czy jest regularny czy nieregularny

source: Color
pl: Kolor

source: number of occurring colors out of six permissible ones
pl: liczba występujących kolorów spośród dopuszczalnych sześciu

source: Diversity of structures
pl: Różnorodność struktury

source: number of different structures within the lesion out of five possible
pl: liczba różnych struktur w obrębie znamienia spośród pięciu możliwych

source: The Stolz strategy forms the basis for our preliminary diagnostic form for melanocytic lesions.
pl: Strategia Stolz'a stanowi podstawę naszego formularza do wstępnej diagnostyki znamionmelanocytowych.

source: A - Asymmetry
pl: A - Asymetria

source: Asymmetry involves determining the symmetry of the lesion by identifying the number of double axes of symmetry lying in the plane of the lesion.
pl: Asymetria polega na wyznaczeniu symetrii znamienia, poprzez znalezienie informacji o liczbie dwukrotnych osi symetrii, leżących w płaszczyźnie znamienia.

source: Assessment of lesion asymmetry
pl: Ocena asymetrii znamion

source: Initially, a double axis of symmetry is sought. If a first double axis is found, a second axis perpendicular to the first is sought.
pl: Początkowo poszukuje się dwukrotnej osi symetrii. W przypadku znalezienia pierwszej dwukrotnej osisymetrii, poszukuje się drugiej osi, prostopadłej do osi pierwszej.

source: Lesion
pl: Znamię

source: One axis of symmetry
pl: Jedna oś symetrii

source: Two perpendicular axes
pl: Dwie prostopadłe osie

source: If the lesion has two mutually perpendicular axes of symmetry, the asymmetry score is 0 - the lesion is symmetric. If there is symmetry along only one axis, the asymmetry score is 1 - asymmetric with respect to one axis. If no axis divides the lesion into two approximately equal parts, the asymmetry score is 2 - asymmetric with respect to both axes.
pl: Jeżeli znamię posiada dwie, wzajemnie prostopadłe osie symetrii wartość wyniku oceny asymetriiznamienia wynosi 0 - znamię jest symetryczne. W przypadku wystąpienia asymetrii względem jednej osisymptom asymetrii przyjmuje wartość 1 - znamię asymetryczne względem jednej osi symetrii. Natomiast brakjakiejkolwiek osi symetrii, dzielącej obraz znamienia na dwie symetryczne (w przybliżeniu) części(znamię asymetryczne względem dwóch-osi symetrii) powoduje przypisanie symptomowi symptomowi wartości 2.

source: Value 0
pl: Wartość 0

source: Value 1
pl: Wartość 1

source: Value 2
pl: Wartość 2

source: B - Border
pl: B - Brzeg

source: Border is related to the presence of a sharp, abrupt ending of pigment pattern at the periphery of the lesion or a gradual, indistinct cutoff.
pl: Brzeg jest związany z obecnością ostrego, nagłego zakończenia pigmentu na obwodzie zmiany lub stopniowego, niewyraźnego odcięcia”

source: Lesion border analysis
pl: Analiza brzegu znamienia

source: Determining the border character involves analyzing the pigment distribution at the junction between the lesion and healthy skin. To conduct an accurate evaluation, the lesion is divided into eight approximately equal parts formed by two pairs of perpendicular axes intersecting at one point. Then the sharpness of the transition between the lesion and healthy skin is assessed in each part. The transition can be sharp (1 point) or blurred (0 points). The final Border score ranges from 0 to 8. Division into parts is shown below:
pl: Określenie charakteru brzegu znamienia polega na analizie układu barwnika, zlokalizowanego w obszarze połączenia znamienia oraz zdrowej skóry. W celu przeprowadzenia dokładnej oceny, znamię dzieli się na osiem równych (w przybliżeniu) części, utworzonych przez dwie pary prostopadłych osi, przecinających się w jednym punkcie. Następnie ocenia się ostrość przejścia pomiędzy znamieniem a zdrową skórą w każdej części znamienia. Przejście to może być ostre (1 punkt) lub rozmyte (0 punktów). Ostateczna wartość symptomu Border mieści się w zakresie od 0 do 8. Podział na części zademonstrowany poniżej:

source: Division into 8 segments
pl: Podział na 8 segmentów

source: During studies on the ABCD rule conducted by researchers Z.S. Hippe and Ł. Piątek, new properties of the Border symptom were observed. For B=2, 28 unique configurations are possible, obtained through symmetry operations with respect to an 8-fold axis perpendicular to the image plane.
pl: Podczas badań nad regułą ABCD przeprowadzanych przez badaczy Z.S. Hippe i Ł. Piątka zaobserwowano nowe własności symptomu Brzegu. Dla wartości B=2 możliwych jest 28 unikalnych konfiguracji, uzyskanych w wyniku zastosowania operacji symetrii względem 8-krotnej osi symetrii, prostopadłej do płaszczyzny obrazu.

source: 28 border configurations
pl: 28 konfiguracji brzegu

source: For the full range of Border values (0 to 8), there are a total of 256 possible configurations of sharp and blurred border segments.
pl: Dla pełnego zakresu wartości symptomu Border (od 0 do 8) istnieje łącznie 256 możliwych konfiguracji rozkładu ostrych i rozmytych fragmentów brzegu.

source: Example border combinations
pl: Przykładowe kombinacje brzegów

source: Case 1
pl: Przypadek 1

source: Case 2
pl: Przypadek 2

source: C - Color
pl: C - Kolor

source: Color refers to the number of distinct hues visible within the lesion.
pl: Kolor odnosi się do ilości różnych odcieni widocznych w obrębie zmiany.

source: Distinction of lesion color
pl: Rozróżnienie koloru zmiany

source: This symptom is characterized as multi-valued. It describes the presence or absence of allowed ABCD rule colors on the lesion surface. The evaluation involves identifying any number of colors from the set of 6 permitted ones (white, blue, dark brown, light brown, black, and red). An additional criterion is the presence of blue color covering more than half of the lesion. Symptom defining the colours occurring in the lesion therefore takes on a value from 1 to 6. A greater variety in this symptom typically correlates with increased clinical suspicion.
pl: Symptom ten ma charakter wielowartościowy. Opisuje obecność lub brak wystąpienia dopuszczonych regułą ABCD kolorów powierzchni znamion. Ocena zabarwienia znamienia polega na stwierdzeniu dowolnej liczby kolorów, ze zbioru 6-ciu kolorów dopuszczonych (białego, błękitnego, ciemno brązowego, jasno brązowego, czarnego oraz czerwonego). Dodatkowym kryterium w symptomie jest obecność koloru niebieskiego na ponad połowie znamienia. Symptom określający kolory występujące w znamieniu przyjmuje zatem wartość z przedziału od 1 do 6.

source: Colors
pl: Kolory

source: Colors in the ABCD rule
pl: Kolory w formule ABCD

source: D - Diversity of structures
pl: D - Różnorodność struktury

source: Diversity of structures refers to the range of patterns seen within the lesion under dermatoscopic examination.
pl: Różnorodność struktur odnosi się do zakresu struktur widocznychw obrębie zmiany poddawanej badaniu dermatoskopowemu.

source: Assessment of structural diversity
pl: Ocena różnorodności strukturalnej

source: The last symptom is multi-valued aswell. It describes structures permitted by the ABCD rule on lesion surfaces. Evaluation involves identifying the presence of five main elements: pigment globules, pigment dots, structureless areas, branched streaks, and pigment network. The assessment of the diversity of the mole structures therefore results in assigning a value from 1 to 5 to the symptom of Diversity of structure. Significant diversity of these elements increases the probability that the lesion is a melanoma.
pl: Ostatni symptom omawianych znamion - Diversity of structures - również tak jak kolor ma charakter wielowartościowy. Opisuje dopuszczone regułą ABCD struktury zróżnicowania powierzchni znamion. Ocena wystąpienia elementów strukturalnych, polega na określeniu obecności 5-ciu głównych elementów, tj.: ciałek barwnikowych, kropek barwnikowych, pól bezstrukturalnych, rozgałęzień pasmowatych oraz sieci barwnikowej. Ocena zróżnicowania struktur znamienia powoduje zatem przypisanie symptomowi Diversity of structure wartości z zakresu od 1 do 5. Znaczące zróżnicowanie elementów strukturalnych zwiększa prawdopodobieństwo, że oceniane znamię jest czerniakiem.

source: Lesion structures
pl: Struktury znamienia

source: Structure examples
pl: Przykłady struktur

source: TDS Parameter - Total Dermatoscopy Score
pl: Parametr TDS - Całkowity Wskaźnik Dermatoskopowy

source: The previously described elements of the ABCD rule are used to calculate the Total Dermatoscopy Score (TDS).
pl: Opisane wcześniej elementy reguły ABCD służą do wyznaczenia całkowitej oceny dermatoskopowej TDS (ang. Total Dermatoscopy Score).

source: The TDS value helps identify the nature of the lesion. Based on the score, the lesion can be classified into one of four categories:
pl: Wartość parametru TDS umożliwia identyfikację charakteru znamienia. Na podstawie uzyskanej punktacji znamię można zaklasyfikować do jednej z czterech kategorii:

source: Benign lesion
pl: Znamię łagodne

source: Blue nevi
pl: Znamiona błękitne

source: Suspicious lesion
pl: Znamię podejrzane

source: Malignant lesion (melanoma)
pl: Znamię złośliwe (czerniak)

source: Classification table
pl: Tabela klasyfikacji

source: Lesion classification based on TDS
pl: Tabela klasyfikacji znamion na podstawie TDS

source: Classic TDS formula according to Braun-Falco:
pl: Wzór na klasyczny TDS wg Braun-Falco:

source: Example TDS assessment
pl: Przykład oceny TDS

source: According to Stolz's strategy, the example lesion has no axis of symmetry, one sharp border segment, two colors (dark and light brown), and two structures.
pl: Według strategii Stolz'a, przykładowe znamię nie posiada żadnej osi symetrii, ma jeden ostry fragment brzegu, dwa kolory (ciemno i jasno brązowy) oraz dwie struktury.

source: TDS example
pl: TDS przykład

source: TDS calculation example
pl: Przykład obliczania TDS

source: Therefore:
pl: Zatem:

source: According to the classification, the lesion should be considered suspicious and potentially dangerous.
pl: Zgodnie z klasyfikacją, znamię należy uznać za podejrzane i potencjalnie niebezpieczne.

source: Improved TDS formula
pl: Usprawniony wzór TDS

source: As a result of research, scientists developed a more precise TDS formula, assigning individual weights to each color and structure.
pl: W wyniku badań naukowcy opracowali bardziej precyzyjny wzór TDS, w którym każdemu kolorowi oraz strukturze przypisano indywidualną wagę.

source: Summary
pl: Podsumowanie

source: Among the three most popular methods for evaluating skin melanocytic lesions, available literature highlights the particular effectiveness of the Braun-Falco and Stolz strategies. This strategy is now widely used by physicians both in Western Europe and in Poland. It has also been found that less experienced clinicians achieve higher diagnostic accuracy when applying the ABCD rule during examinations.
pl: Spośród trzech najpopularniejszych metod oceny znamion melanocytowych skóry, dostępna literatura wskazuje na szczególną skuteczność strategii Braun-Falco i Stolz'a. Strategia ta jest obecnie powszechnie stosowana przez lekarzy, zarówno w Europie Zachodniej, jak również w Polsce. Stwierdzono także, że mniej doświadczeni klinicyści uzyskują lepszą poprawność diagnoz, jeżeli stosują podczas badań regułę ABCD.

source: The ABCD-based form available on our website offers results based on both the basic TDS and its extended version.
pl: Formularz oparty na strategii ABCD dostępny na naszej stronie oferuje zarówno wynik na podstawie bazowego TDS jak i jego rozwiniętej wersji.

source: Visit the diagnostics page and analyze your lesion.
pl: Odwiedź podstronę diagnostyka i przeanalizuj swoję znamię.

source: Diagnostics
pl: Diagnostyka

source: Melanoma Analysis
pl: Analiza Melanomy

source: Home
pl: Strona główna

source: About ABCD Rule
pl: O zasadzie ABCD

source: About Melanoma
pl: O Melanomie

source: Characteristics
pl: Charakterystyka

source: Publications
pl: Publikacje

source: Companies
pl: Branża

source: This website was created in a collaboration
pl: Ta strona powstałą we współpracy

source: Location
pl: Lokalizacja

source: Sucharskiego St. 2
pl: ul. Sucharskiego 2

source: 35-225 Rzeszow, PL
pl: 35-225 Rzeszów, PL

source: University of Information Technology and Management
pl: Wyższa Szkoła Informatyki i Zarządzania

source: University Website
pl: Strona uczelni

source: Contact
pl: Kontakt

source: Phone: 17 866 11 11
pl: Telefon: 17 866 11 11

source: Academic Research Project
pl: Akademicki Projekt Badawczy

source: Skin Lesion Characteristics
pl: Charakterystyka zmian skórnych

source: Understanding Skin Lesions
pl: Zrozumieć zmiany Melanocytowe

source: Read more about different skin lesions and learn how to recognize them.
pl: Czytaj więcej o różnego rodzaju zmianach skórnych i dowiedz się jak je rozróżniać.

source: What Are Melanocytic Lesions?
pl: Czym są zmiany Melanocytowe?

source: Melanocytic nevi are also called benign melanocytic tumors because, as a rule, most of them are benign and never become malignant. However, approximately 30 percent of malignant melanomas, which are one of the most dangerous skin cancers of today, arise from these lesions.
pl: Znamiona melanocytowe nazywane są również łagodnymi nowotworami melanocytowymi, gdyż z reguły większość z nich ma charakter łagodny i nigdy nie złośliwieje. Niemniej jednak na podłożu tych zmian powstaje ok. 30 procent czerniaków złośliwych, stanowiącego jeden z naj-groźniejszych nowotworów skóry dzisiejszych czasów.

source: Classification of Melanocytic Nevi
pl: Klasyfikacja Znamion Melanocytowych

source: Melanocytic nevi (the name comes from melanocytes, i.e., cells that produce the skin pigment – melanin) are divided into epidermal and dermal types.
pl: Znamiona melanocytowe (nazwa pochodzi od melanocytu, tj. komórki produkującej barwnik skóry - melaninę) dzielą się na naskórkowe i skórne.

source: Epidermal
pl: Naskórkowe

source: The first group includes so-called flat nevi and lentigo maligna, where:
pl: Do grupy pierwszej należą tzw. znamiona płaskie i plamy soczewicowate, przy czym:

source: Flat nevi
pl: Znamiona płaskie
