Repository: gwanat/python_melanoma_app
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: pl

source: Flat nevi are at the level of the skin, well-defined from the surrounding tissue, do not cause any discomfort, and tend to enlarge with a person’s growth. In the case of chronic irritation, they may become a starting point for malignant skin cancer – melanoma. However, this is rare.
pl: Znamiona płaskie znajdują się na poziomie skóry, są odgraniczone od otoczenia, nie powodują żadnych dolegliwości, jednocześnie powiększając się wraz z rozwojem człowieka. W przypadku przewlekłego drażnienia mogą być punktem wyjścia złośliwego nowotworu skóry - czerniaka. Zdarza się to jednak rzadko.

source: Lentigo maligna
pl: Plamy soczewicowate

source: Lentigo maligna can be congenital or acquired. They look very similar to each other – small, numerous brown spots of various shades. They resemble freckles but are slightly larger and more defined. Congenital lentigo maligna appears in childhood, usually on the skin of the back and chest. Acquired lentigo maligna can develop due to sun exposure (sun lentigo) or in older individuals (senile lentigo). They can be single or numerous, typically located on the skin of exposed areas (face, hands, forearms). They appear more frequently in the summer and darken during this time. Sun lentigo may gradually disappear on its own, while senile lentigo tends to be a permanent change.
pl: plamy soczewicowate bywają wrodzone i nabyte. Wyglądem są do siebie bardzo podobne - drobne, liczne plamki barwy brunatnej o różnych odcieniach. Przypominają piegi, ale są nieco większe i bardziej odgraniczone. Wrodzone plamy soczewicowate pojawiają się w dzieciństwie - na ogół na skórze pleców i klatki piersiowej. Z kolei plamy nabyte mogą pojawiać się pod wpływem promieni słonecznych (plamy soczewicowate słoneczne) lub u osób starszych (plamy soczewicowate starcze). Mogą one być pojedyncze lub liczne, zwykle zlokalizowane są na skórze odkrytych części ciała (twarz, ręce, przedramiona). Pojawiają się liczniej latem i o tej porze roku także ciemnieją. Plamy soczewicowate słoneczne mogą stopniowo samoistnie zanikać, natomiast starcze mają charakter zmian trwałych.

source: Malignant lentigo spots are very dangerous because they are often a starting point for melanoma. They are dark and generally irregularly pigmented, sometimes slightly raised. They occur on the face, more often in women and older individuals. They develop slowly, and if they transform into melanoma, the course of the disease is relatively mild.
pl: złośliwe plamy soczewicowate są bardzo niebiezpieczne, ze względu na bycie często punktem wyjścia czerniaka. Są one ciemne i na ogół nieregularnie zabarwione, niekiedy nieco uwypuklone. Występują na twarzy, częściej u kobiet i u osób w starszym wieku. Rozwijają się wolno, a w razie ich przekształcenia się w czerniaka przebieg choroby jest stosunkowo łagodny.

source: Dermal
pl: Skórne

source: Blue nevi are a type of dermal melanocytic nevus. The pigment cells are located quite deep in the skin, usually on the face and extremities. The nevi range in color from light blue to black. They are considered safe nevi, meaning they rarely serve as a starting point for melanomas.
pl: Znamiona błękitne należą do skórnych znamion melanocytowych. Komórki barwnikowe są tu umiejscowione dość głęboko w skórze, zwykle na twarzy i koń-czynach. Znamiona przybierają barwę od jasnoniebieskiej do czarnej. Należą do tzw. bez-piecznych znamion, tzn. rzadko są punktem wyjścia czerniaków.

source: Classification of melanocytic skin lesions
pl: Klasyfikacja skórnych zmian melanocytowych

source: Melanocytic nevi can widely vary in clinical dermatoscopic and histological appearance. Lesions are categorized based on many factors: placement, color patterns, shape, growth and many more. It is important to have some understanding about how to recognize suspicious nevi. Below you can find a list of most common types of skin lesions.
pl: Znamiona melanocytowe mogą się znacznie różnić pod względem obrazu klinicznego, dermatoskopowego i histologicznego. Zmiany skórne klasyfikuje się na podstawie wielu czynników: umiejscowienia, wzoru zabarwienia, kształtu, rozrostu i wielu innych. Ważne jest, aby mieć jakąś wiedzę i świadomość związaną z rozpoznawaniem podejrzanych znamion. Poniżej znajduje się lista najczęściej występujących typów zmian skórnych.

source: Learn More
pl: Czytaj więcej

source: Melanoma Risk Factors
pl: Czynniki Ryzyka Czerniaka

source: Key factors increasing melanoma development risk:
pl: Czynniki zwiększające ryzyko powstania czerniaka skóry:

source: Excessive UV exposure causing sunburns (especially during childhood/adolescence)
pl: Nadmierna ekspozycja na promieniowanie ultrafioletowe, prowadząca do oparzenia (jest szczególnie szkodliwa w wieku dziecięcym i młodości)

source: Lifetime cumulative sun exposure
pl: Życiowa skumulowana nadmierna ekspozycja na światło słoneczne

source: Prolonged sun exposure between 10AM-2PM
pl: Długie przebywanie na słońcu, szczególnie w godzinach 10.00 - 14.00

source: Recreational/intermittent sun exposure
pl: Rekreacyjna, sporadyczna ekspozycja na słońce

source: Inadequate sun protection use
pl: Brak ochrony przeciwsłonecznej lub jej niewłaściwe stosowanie

source: Frequent use of tanning beds/lamps
pl: Częste korzystanie z lamp kwarcowych i solarium

source: Fair complexion (blonde/red hair, blue eyes), especially with chronic sun exposure
pl: jasna karnacja (włosy blond lub rude, niebieskie oczy), zwłaszcza przy przewlekłej ekspozycji na promieniowanie słoneczne

source: Numerous melanocytic nevi
pl: Duża liczba znamion barwnikowych

source: Previous melanoma diagnosis
pl: Wcześniej stwierdzony czerniak

source: Family history of melanoma
pl: Historia zachorowań na czerniaka w rodzinie

source: Immunosuppression (from disease or medications)
pl: Obniżona odporność organizmu (w przebiegu choroby lub po niektórych lekach)

source: Chronic irritation or damage of pigmented lesions
pl: Stałe drażnienie i urazy znamion barwnikowych

source: Remember:
pl: Pamiętaj:

source: Regular self-exams and professional dermatoscopic evaluations are crucial for early detection.
pl: Regularne samobadanie i profesjonalna diagnostyka są kluczem do wczesnego wykrycia.

source: Do you want to analyze a lesion?
pl: Czy chciałbyś przeanalizować znamię?

source: Diagnostics - Melanoma Analysis
pl: Diagnostyka - Analiza zmiany skórnej

source: Melanoma Diagnostics
pl: Diagnostyka zmiany skórnej

source: This tool provides an initial diagnostic suggestion based on the Stolz ABCD rule of dermatoscopy. It is not a replacement for professional medical evaluation. If you are unsure about how to complete any part of the form, click the information icon next to each section to learn more or visit the ABCD Rule subpage.
pl: To narzędzie dostarcza wstępnej sugestii diagnostycznej na podstawie zasady ABCD Stolza w dermatoskopii. Nie zastępuje ono profesjonalnej oceny medycznej. Jeśli nie jesteś pewien, jak wypełnić którąkolwiek część formularza, kliknij ikonę informacji obok każdej sekcji, aby dowiedzieć się więcej, lub odwiedź podstronę o zasadzie ABCD.

source: Asymmetry (A)
pl: Asymetria (A)

source: Measures whether the shape of the lesion is uneven.
pl: Uwzględnia nierównomierność w kształcie zmiany.

source: 0 (Symmetrical)
pl: 0 (Symetryczna)

source: 1 (One-Axial Asymmetry)
pl: 1 (Jednoosiowa Asymetria)

source: 2 (Two-Axial Asymmetry)
pl: 2 (Dwuosiowa Asymetria)

source: More about the Asymmetry factor
pl: Więcej o czynniku Asymetrii

source: Divide the lesion in half (twice, perpendicular axes). Score 1 point for each axis where halves don't match.
pl: Podziel zmianę na pół (dwa razy, osie prostopadle do siebie). Przydziel 1 punkt za

source: Example of asymmetrical lesion
pl: Przykład znamienia asymetrycznego

source: Border (B)
pl: Brzeg (B)

source: Measures irregularity of the lesion divided into eight sections.
pl: Uwzględnia nieregularność zmiany podzielonej na 8 sekcji.

source: More about the Border factor
pl: Więcej o czynniku Brzegu

source: Divide the lesion into 8 sections. Count how many have an abrupt (sharp, uneven) border.
pl: Podziel zmianę na 8 części. Policz, ile z nich ma nagłą (ostrą, nierówną) granicę.

source: Color (C)
pl: Kolor (C)

source: Measures presence of multiple colors within the lesion.
pl: Uwzględnia obecność różnych kolorów w obrębie zmiany.

source: Light Brown
pl: Jasny brąz

source: Dark Brown
pl: Ciemny brąz

source: Black
pl: Czarny

source: Red
pl: Czerwony

source: White
pl: Biały

source: Blue/Grey
pl: Niebieski/Szary

source: Blue covers over half?
pl: Niebieski pokrywa ponad połowę?

source: More about the Color factor
pl: Więcej o czynniku Koloru

source: Count the number of distinct colors present.
pl: Policz liczbę różnych kolorów.

source: Diversity of Structures (D)
pl: Różnorodność struktury (D)

source: Measures variety of patterns and structures within the lesion.
pl: Uwzględnia różnorodność wzorców i struktur w obrębie zmiany.

source: Pigment Networks
pl: Sieć barwnikowa

source: Pigment Dots
pl: Kropki barwnikowe

source: Pigment Globules
pl: Ciałka barwnikowe

source: Branched Streaks
pl: Rozgałęzienia pasmowate

source: Structureless Areas
pl: Pole bezstrukturalne

source: More about the Diversity of Structures factor
pl: Więcej o czynniku Różnorodności struktury

source: Count how many different dermoscopic structures are visible.
pl: Policz ile jest widocznych różnych struktur dermatoskopowych.

source: Submit
pl: Zatwierdź

source: Total Dermatoscopy Score:
pl: Całkowity Wskaźnik Dermatoskopowy:

source: New Total Dermatoscopy Score:
pl: Nowy Całkowity Wskaźnik Dermatoskopowy:

source: Diagnostic System for
pl: System Diagnostyki dla

source: Melanocytic Skin Lesions
pl: Skórnych Zmian Melanocytowych

source: Start Diagnosis
pl: Zacznij diagnostykę

source: Field of Dermatoscopy
pl: Dziedzina Dermatoskopii

source: Discover companies which apply diagnostics with AI and advanced imaging technology
pl: Odkryj firmy, które stosują diagnostykę z wykorzystaniem AI oraz obrazowanie medyczne

source: Companies connected with dermatoscopy
pl: Firmy związane z dermatoskopią

source: Below we are presenting companies supporting skin lesions diagnostics with a use of Artificial Intelligence or advanced videodermatoscopy hardware
pl: Poniżej znajdują się firmy wspierające diagnostykę zmian skórnych przy użyciu Sztucznej Inteligencji bądź zaawansowanego sprzętu do wideodermatoskopii

source: Startups
pl: Startupy

source: Software
pl: Oprogramowanie

source: AI skin cancer recognition
pl: Rozpoznawanie raka skóry przy pomocy SI

source: System of specialized algorithms for the automatic recognition of skin cancer for epiluminescence microscopy (ELM) images with the potential to be used in doctor's offices and other health care units for screening for early melanoma. Thanks to Artificial Intelligence and Machine Learning (Deep Learning) algorithms, it recognizes melanocytic nevi on the basis of photos taken with a videodermoscope.
pl: System specjalistycznych algorytmów do automatycznego rozpoznawania raka skóry na podstawie obrazów mikroskopii epiluminescencyjnej (ELM) z potencjalnym zastosowaniem w gabinetach lekarskich i innych jednostkach służby zdrowia do badań przesiewowych w kierunku wczesnego czerniaka. Dzięki algorytmom sztucznej inteligencji i uczenia maszynowego (Deep Learning) rozpoznaje znamiona melanocytowe na podstawie zdjęć wykonanych wideodermoskopem.

source: Hardware
pl: Sprzęt

source: Imaging Solutions
pl: Rozwiązania w zakresie obrazowania

source: FotoFinder specializes in high-end hardware for dermatological imaging, particularly in videodermatoscopy and total body photography. Their systems combine advanced optics with polarized lighting to capture highly detailed skin images.
pl: FotoFinder specjalizuje się w sprzęcie najwyższej klasy do obrazowania dermatologicznego, zwłaszcza w wideodermatoskopii i fotografii całego ciała. Ich systemy łączą zaawansowaną optykę z oświetleniem spolaryzowanym, aby uchwycić bardzo szczegółowe obrazy skóry”

source: Multifunctional Platform Studio
pl: Multifunkcyjna Platforma Studio

source: The multifunctional platform enables the diagnosis of moles, nails, and the scalp. It allows for the creation of automatic trichograms essential for planning hair transplants, and also provides “before and after” facial images. The system is ideal for comparing changes in moles and monitoring progress in hair loss treatment as well as the effects of beauty and anti-aging therapies.
pl: Multifunkcyjna platforma pozwala na diagnostykę znamion, paznokci oraz skóry głowy. Umożliwia tworzenie automatycznych trichogramów niezbędnych przy planowaniu przeszczepów włosów, a także dostarcza zdjęcia twarzy \„przed i po\”. System doskonale spełnia się w porównywaniu zmian zachodzących w obrębie znamion oraz w monitorowaniu postępów leczenia łysienia i efektów terapii beauty/anti-aging.

source: Handyscope DermLite
pl: Handyscope DermLite (dermoskop ręczny)

source: The handyscope DermLite is a portable device that works with almost any smartphone. Leviacam, on the other hand, is a portable camera that easily connects to a computer or laptop.
pl: handyscope DermLite to przenośne urządzenie, które współpracuje niemal z każdym telefonem. Z kolei leviacam to przenośna kamera, która w łatwy sposób łączy się z komputerem lub laptopem.

source: Scientific Publications
pl: Publikacje Naukowe

source: Read through publications concerning diagnosis and processing of melanocytic lesions images
pl: Zapoznaj się z publikacjami dotyczącymi diagnostyki i przetwarzania zdjęć zmian melanocytowych

source: The listed publications were authored or co-authored by researchers from the Department of Artificial Intelligence at the University of Information Technology and Management in Rzeszów (UITM). Their research explores medical image analysis—particularly of melanocytic skin lesions—covering image synthesis, feature selection, classification methods, and the application of rough sets and machine learning to support early and accurate diagnosis.
pl: Podane publikacje zostały stworzone lub współtworzone przy udziale pracowników Katedry Sztucznej Inteligencji Wyższej Szkoły Informatyki i Zarządzania w Rzeszowie (UITM). Ich badania dotyczą analizy obrazów medycznych — w szczególności zmian melanocytowych skóry — obejmując syntezę obrazów, selekcję cech, metody klasyfikacji oraz zastosowanie zbiorów przybliżonych i uczenia maszynowego w celu wspierania wczesnej i dokładnej diagnozy.

source: List of related publications
pl: Lista powiązanych publikacji

source: View on ORCID
pl: Zobacz na ORCID

source: View the article
pl: Wyświetl artykuł
